In [1]:
import os
import json
import psycopg2
from psycopg2.extras import DictCursor
POSTGRESQL_HOST = '10.129.0.25'
%load_ext sql

In [2]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    os.environ['POSTGRESQL_USER'],
    os.environ['POSTGRESQL_PASSWORD'],
    POSTGRESQL_HOST,
    'demo'
)

## 1. Output a list of tickets, where number of flights > 3 ##

In [ ]:
%%sql $CONNECT_DATA
SELECT book_ref, passenger_id, COUNT(DISTINCT ticket_no)
FROM Tickets
GROUP BY book_ref, passenger_id, ticket_no
HAVING COUNT(DISTINCT ticket_no)=1
ORDER BY ticket_no DESC

2949857 rows affected.

In [ ]:
%%sql $CONNECT_DATA
SELECT book_ref, COUNT(ticket_no) as Num_Flights   
FROM tickets
GROUP BY book_ref
ORDER BY Num_Flights desc

2. Output a total number of tickets which have exactly 5 flights

In [ ]:
%%sql $CONNECT_DATA
SELECT COUNT(*)   
FROM Tickets   
WHERE num_flights = 5

In [1]:
!pip install ipython-sql
%load_ext sql
import psycopg2

with psycopg2.connect(
    dbname='jovyan'
) as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT datname FROM pg_database')
        records = cur.fetchall()
        
print(records)

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.
[('postgres',), ('jovyan',), ('template1',), ('template0',)]

## 3. Create and fill 2 tables exactly like those below

SQL Script for Departments Table

In [7]:
%%sql postgresql:///jovyan
CREATE Table Staff (  
    EMPLOYEE_ID INT PRIMARY KEY,  
    FIRST_NAME VARCHAR(50),  
    LAST_NAME VARCHAR(50),  
    HIRE_DATE DATE,  
    JOB_ID VARCHAR(10),  
    MANAGER_ID INT,  
    DEPARTMENT_ID INT  
);  

INSERT INTO Staff (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID) VALUES  
(200, 'Alice', 'Johnson', '1990-01-15', 'HR_REP', 201, 40),  
(201, 'Bob', 'Smith', '1990-02-20', 'HR_MGR', NULL, 40),  
(202, 'Charlie', 'Brown', '1990-03-25', 'IT_PROG', 203, 60),  
(203, 'David', 'Wilson', '1990-04-30', 'IT_MGR', NULL, 60),  
(204, 'Eva', 'Davis', '1990-05-05', 'SA_REP', 205, 80),  
(205, 'Frank', 'Miller', '1990-06-10', 'SA_MGR', NULL, 80),  
(206, 'Grace', 'Lee', '1990-07-15', 'FI_ACCOUNT', 207, 100),  
(207, 'Hank', 'Taylor', '1990-08-20', 'FI_MGR', NULL, 100),  
(208, 'Ivy', 'Anderson', '1990-09-25', 'PU_CLERK', 209, 30),  
(209, 'Jack', 'Thomas', '1990-10-30', 'PU_MAN', NULL, 30),  
(210, 'Karen', 'White', '1990-11-05', 'ST_CLERK', 211, 50),  
(211, 'Leo', 'Harris', '1990-12-10', 'ST_MGR', NULL, 50),  
(212, 'Mia', 'Clark', '1991-01-15', 'AD_ASST', 213, 90),  
(213, 'Nina', 'Lewis', '1991-02-20', 'AD_VP', 214, 90),  
(214, 'Oscar', 'Walker', '1991-03-25', 'AD_PRES', NULL, 90);

(psycopg2.errors.DuplicateTable) relation "staff" already exists

[SQL: CREATE Table Staff (
    EMPLOYEE_ID INT PRIMARY KEY,
    FIRST_NAME VARCHAR(50),
    LAST_NAME VARCHAR(50),
    HIRE_DATE DATE,
    JOB_ID VARCHAR(10),
    MANAGER_ID INT,
    DEPARTMENT_ID INT
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [8]:
%%sql postgresql:///jovyan
SELECT * FROM Staff

15 rows affected.

[(200, 'Alice', 'Johnson', datetime.date(1990, 1, 15), 'HR_REP', 201, 40),
 (201, 'Bob', 'Smith', datetime.date(1990, 2, 20), 'HR_MGR', None, 40),
 (202, 'Charlie', 'Brown', datetime.date(1990, 3, 25), 'IT_PROG', 203, 60),
 (203, 'David', 'Wilson', datetime.date(1990, 4, 30), 'IT_MGR', None, 60),
 (204, 'Eva', 'Davis', datetime.date(1990, 5, 5), 'SA_REP', 205, 80),
 (205, 'Frank', 'Miller', datetime.date(1990, 6, 10), 'SA_MGR', None, 80),
 (206, 'Grace', 'Lee', datetime.date(1990, 7, 15), 'FI_ACCOUNT', 207, 100),
 (207, 'Hank', 'Taylor', datetime.date(1990, 8, 20), 'FI_MGR', None, 100),
 (208, 'Ivy', 'Anderson', datetime.date(1990, 9, 25), 'PU_CLERK', 209, 30),
 (209, 'Jack', 'Thomas', datetime.date(1990, 10, 30), 'PU_MAN', None, 30),
 (210, 'Karen', 'White', datetime.date(1990, 11, 5), 'ST_CLERK', 211, 50),
 (211, 'Leo', 'Harris', datetime.date(1990, 12, 10), 'ST_MGR', None, 50),
 (212, 'Mia', 'Clark', datetime.date(1991, 1, 15), 'AD_ASST', 213, 90),
 (213, 'Nina', 'Lewis', datetime.date(1991, 2, 20), 'AD_VP', 214, 90),
 (214, 'Oscar', 'Walker', datetime.date(1991, 3, 25), 'AD_PRES', None, 90)]

In [19]:
%%sql postgresql:///jovyan
CREATE TABLE Divisions (  
    DEPARTMENT_ID INT PRIMARY KEY,  
    DEPARTMENT_NAME VARCHAR(100),  
    MANAGER_ID INT  
);

(psycopg2.errors.DuplicateTable) relation "divisions" already exists

[SQL: CREATE TABLE Divisions (
    DEPARTMENT_ID INT PRIMARY KEY,
    DEPARTMENT_NAME VARCHAR(100),
    MANAGER_ID INT
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [20]:
%%sql postgresql:///jovyan
INSERT INTO Divisions (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID) VALUES  
(10, 'Administration', 200),  
(30, 'Purchasing', 114),  
(40, 'HumanResources', 203),  
(50, 'Shipping', 121),  
(60, 'IT', 103),  
(70, 'PublicRelations', 204),  
(80, 'Sales', 145),  
(90, 'Executive', 100),  
(100, 'Finance', 108),  
(110, 'Accounting', 205);

10 rows affected.

[]

In [21]:
%%sql postgresql:///jovyan
SELECT * FROM Divisions

10 rows affected.

[(10, 'Administration', 200),
 (30, 'Purchasing', 114),
 (40, 'HumanResources', 203),
 (50, 'Shipping', 121),
 (60, 'IT', 103),
 (70, 'PublicRelations', 204),
 (80, 'Sales', 145),
 (90, 'Executive', 100),
 (100, 'Finance', 108),
 (110, 'Accounting', 205)]

Write a query: Output the Department_name which has the longest-working employee in the company, together with the First_name + Last_name of this employee.

In [ ]:
%%sql $CONNECT_DATA
SELECT   
    d.DEPARTMENT_NAME,   
    CONCAT(e.FIRST_NAME, ' ', e.LAST_NAME) AS Employee_Name  
FROM   
    Employees e  
JOIN   
    Departments d ON e.DEPARTMENT_ID = d.DEPARTMENT_ID  
WHERE   
    e.HIRE_DATE = (SELECT MIN(HIRE_DATE) FROM Employees);